CloseRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:mes="http://www.ebxml.org/namespaces/messageHeader" xmlns:ns="http://www.opentravel.org/OTA/2002/11">
  <soapenv:Header>
    <sec:Security>
      <!--Optional:-->
      <sec:UsernameToken>
        <!--Optional:-->
        <sec:Username></sec:Username>
        <!--Optional:-->
        <sec:Password></sec:Password>
        <!--0 to 2 repetitions:-->
        <sec:NewPassword></sec:NewPassword>
        <!--Optional:-->
        <Organization></Organization>
        <!--Optional:-->
        <Domain></Domain>
      </sec:UsernameToken>
      <!--Optional:-->
      <sec:SabreAth></sec:SabreAth>
      <!--Optional:-->
      <sec:BinarySecurityToken>{{key}}</sec:BinarySecurityToken>
    </sec:Security>
    <mes:MessageHeader mes:id="" mes:version="">
      <mes:From>
        <!--1 or more repetitions:-->
        <mes:PartyId mes:type=""></mes:PartyId>
        <!--Optional:-->
        <mes:Role></mes:Role>
      </mes:From>
      <mes:To>
        <!--1 or more repetitions:-->
        <mes:PartyId mes:type=""></mes:PartyId>
        <!--Optional:-->
        <mes:Role></mes:Role>
      </mes:To>
      <mes:CPAId></mes:CPAId>
      <mes:ConversationId>SessionClose</mes:ConversationId>
      <mes:Service mes:type=""></mes:Service>
      <mes:Action>SessionCloseRQ</mes:Action>
      <mes:MessageData>
        <mes:MessageId></mes:MessageId>
        <mes:Timestamp></mes:Timestamp>
        <!--Optional:-->
        <mes:RefToMessageId></mes:RefToMessageId>
        <!--Optional:-->
        <mes:TimeToLive></mes:TimeToLive>
        <!--Optional:-->
        <mes:Timeout>60</mes:Timeout>
      </mes:MessageData>
      <!--Optional:-->
      <mes:DuplicateElimination></mes:DuplicateElimination>
      <!--Zero or more repetitions:-->
      <mes:Description xml:lang=""></mes:Description>
      <!--You may enter ANY elements at this point-->
    </mes:MessageHeader>
  </soapenv:Header>
  <soapenv:Body>
    <ns:SessionCloseRQ>
      <ns:POS>
        <ns:Source PseudoCityCode=""/>
      </ns:POS>
    </ns:SessionCloseRQ>
  </soapenv:Body>
</soapenv:Envelope>
